<?
$rubr[0]='Hi-Tech';
$rubr[1]='Работа';
$rubr[2]='Учёба';
$rubr[3]='Дом';
$rubr[4]='Общество';
$rubr[5]='Развлечения';
$rubr[6]='Отдых';
$rubr[7]='Культура';
$rubr[8]='Спорт';
$rubr[9]='СМИ';
$rubr[10]='Бизнес';
$rubr[11]='Справки';
$rubr[12]='Авто';
$rubr[13]='Порталы';
$rubr[14]='Универсальное';

$category[4]='Hi-Tech';
$category[636]='Hi-Tech Компьютеры';
$category[5]='Hi-Tech Интернет';
$category[311]='Hi-Tech Мобильная связь';
$category[49]='Hi-Tech Программы';
$category[51]='Hi-Tech Безопасность';
$category[47]='Hi-Tech Сети и связь';
$category[679]='Hi-Tech Интерфейс';
$category[1278]='Hi-Tech Универсальное';
$category[1277]='Hi-Tech Прочее';
$category[112]='Работа';
$category[10480]='Работа Вакансии и резюме';
$category[10481]='Работа Кадровые агентства';
$category[10482]='Работа Работа за рубежом';
$category[10483]='Работа Работа для IT-специалистов';
$category[10484]='Работа Временная и удаленная работа';
$category[10994]='Работа Управление персоналом';
$category[11595]='Работа Работа для студентов';
$category[2]='Учёба';
$category[25]='Учёба Высшее образование';
$category[27]='Учёба Курсы';
$category[26]='Учёба Среднее образование';
$category[3281]='Учёба Науки';
$category[2898]='Учёба Учебные материалы';
$category[670]='Учёба Универсальное';
$category[669]='Учёба Прочее';
$category[9]='Дом';
$category[2865]='Дом Квартира и дача';
$category[95]='Дом Кулинария';
$category[668]='Дом Все для праздника';
$category[2866]='Дом Семья';
$category[97]='Дом Домашние животные';
$category[96]='Дом Здоровье';
$category[105]='Дом Мода и красота';
$category[103]='Дом Покупки';
$category[350]='Дом Универсальное';
$category[3]='Общество';
$category[37]='Общество Власть';
$category[233]='Общество Законы';
$category[39]='Общество НКО';
$category[40]='Общество Политика';
$category[43]='Общество Религия';
$category[958]='Общество Универсальное';
$category[957]='Общество Прочее';
$category[8]='Развлечения';
$category[87]='Развлечения Игры';
$category[146]='Развлечения Юмор';
$category[421]='Развлечения Знакомства';
$category[11829]='Развлечения Социальные сети';
$category[11034]='Развлечения Психологические тесты';
$category[11374]='Развлечения Развлекательные издания';
$category[91]='Развлечения Эротика';
$category[12]='Развлечения Непознанное';
$category[10641]='Развлечения Чаты';
$category[1950]='Развлечения Универсальное';
$category[1949]='Развлечения Прочее';
$category[3579]='Отдых';
$category[2877]='Отдых Где развлечься';
$category[88]='Отдых Туризм';
$category[3691]='Отдых Каникулы';
$category[98]='Отдых Хобби';
$category[1]='Культура';
$category[19]='Культура Музыка';
$category[18]='Культура Литература';
$category[20]='Культура Кино';
$category[17]='Культура Театры';
$category[21]='Культура Фотография';
$category[15]='Культура Музеи';
$category[16]='Культура Изобразительные искусства';
$category[661]='Культура Танец';
$category[62]='Культура Универсальное';
$category[61]='Культура Прочее';
$category[90]='Спорт';
$category[411]='Спорт Футбол';
$category[412]='Спорт Хоккей';
$category[410]='Спорт Баскетбол';
$category[417]='Спорт Теннис';
$category[408]='Спорт Автоспорт';
$category[418]='Спорт Шахматы, шашки';
$category[416]='Спорт Силовые виды спорта';
$category[438]='Спорт Единоборства';
$category[11824]='Спорт Спортивные трансляции';
$category[3441]='Спорт Летние виды спорта';
$category[3365]='Спорт Зимние виды спорта';
$category[3343]='Спорт Экстремальный спорт';
$category[660]='Спорт Водный спорт';
$category[439]='Спорт Конкурсы,  тотализатор';
$category[10082]='Спорт Спортивная пресса';
$category[10081]='Спорт Соревнования';
$category[3393]='Спорт Спортивные товары';
$category[11320]='Спорт Спортклубы';
$category[2078]='Спорт Универсальное';
$category[2077]='Спорт Прочее';
$category[11]='СМИ';
$category[118]='СМИ Периодика';
$category[119]='СМИ Информационные агентства';
$category[10060]='СМИ Новости';
$category[117]='СМИ Телевидение';
$category[116]='СМИ Радио';
$category[2206]='СМИ Универсальное';
$category[2205]='СМИ Прочее';
$category[6]='Бизнес';
$category[69]='Бизнес Финансы';
$category[68]='Бизнес Недвижимость';
$category[333]='Бизнес Строительство';
$category[7]='Бизнес Производство и поставки';
$category[73]='Бизнес Реклама';
$category[72]='Бизнес Деловые услуги';
$category[696]='Бизнес Все для офиса';
$category[1502]='Бизнес Универсальное';
$category[1501]='Бизнес Прочее';
$category[3349]='Справки';
$category[3366]='Справки Энциклопедии';
$category[3549]='Справки Словари';
$category[259]='Справки Карты';
$category[12282]='Справки Адреса и телефоны';
$category[66]='Справки Транспорт';
$category[3371]='Справки Афиша';
$category[11252]='Справки Интернет-каталоги';
$category[3504]='Справки Поиск людей';
$category[11185]='Справки Программы ТВ';
$category[2991]='Справки Погода';
$category[99]='Авто';
$category[461]='Авто Продажа автомобилей';
$category[459]='Авто Техническое обслуживание';
$category[460]='Авто Запчасти, аксессуары';
$category[458]='Авто Подготовка водителей';
$category[10089]='Авто Автопресса';
$category[462]='Авто Автолюбители';
$category[457]='Авто Мотоциклы';
$category[3238]='Авто Автострахование';
$category[3016]='Авто Автомобиль и закон';
$category[542]='Авто Универсальное';
$category[541]='Авто Прочее';
$category[11068]='Порталы';
$category[30]='Универсальное';

$podrub['Hi-Tech'][0]='Компьютеры';
$podrub['Hi-Tech'][1]='Интернет';
$podrub['Hi-Tech'][2]='Мобильная связь';
$podrub['Hi-Tech'][3]='Программы';
$podrub['Hi-Tech'][4]='Безопасность';
$podrub['Hi-Tech'][5]='Сети и связь';
$podrub['Hi-Tech'][6]='Интерфейс';
$podrub['Hi-Tech'][7]='Универсальное';
$podrub['Hi-Tech'][8]='Прочее';

$podrub['Работа'][0]='Вакансии и резюме';
$podrub['Работа'][1]='Кадровые агентства';
$podrub['Работа'][2]='Работа за рубежом';
$podrub['Работа'][3]='Работа для IT-специалистов';
$podrub['Работа'][4]='Временная и удаленная работа';
$podrub['Работа'][5]='Управление персоналом';
$podrub['Работа'][6]='Работа для студентов';

$podrub['Учёба'][0]='Высшее образование';
$podrub['Учёба'][1]='Курсы';
$podrub['Учёба'][2]='Среднее образование';
$podrub['Учёба'][3]='Науки';
$podrub['Учёба'][4]='Учебные материалы';
$podrub['Учёба'][5]='Универсальное';
$podrub['Учёба'][6]='Прочее';

$podrub['Дом'][0]='Квартира и дача';
$podrub['Дом'][1]='Кулинария';
$podrub['Дом'][2]='Все для праздника';
$podrub['Дом'][3]='Семья';
$podrub['Дом'][4]='Домашние животные';
$podrub['Дом'][5]='Здоровье';
$podrub['Дом'][6]='Мода и красота';
$podrub['Дом'][7]='Покупки';
$podrub['Дом'][8]='Универсальное';

$podrub['Общество'][0]='Власть';
$podrub['Общество'][1]='Законы';
$podrub['Общество'][2]='НКО';
$podrub['Общество'][3]='Политика';
$podrub['Общество'][4]='Религия';
$podrub['Общество'][5]='Универсальное';
$podrub['Общество'][6]='Прочее';

$podrub['Развлечения'][0]='Игры';
$podrub['Развлечения'][1]='Юмор';
$podrub['Развлечения'][2]='Знакомства';
$podrub['Развлечения'][3]='Социальные сети';
$podrub['Развлечения'][4]='Психологические тесты';
$podrub['Развлечения'][5]='Развлекательные издания';
$podrub['Развлечения'][6]='Эротика';
$podrub['Развлечения'][7]='Непознанное';
$podrub['Развлечения'][8]='Чаты';
$podrub['Развлечения'][9]='Универсальное';
$podrub['Развлечения'][10]='Прочее';

$podrub['Отдых'][0]='Где развлечься';
$podrub['Отдых'][1]='Туризм';
$podrub['Отдых'][2]='Каникулы';
$podrub['Отдых'][3]='Хобби';

$podrub['Культура'][0]='Музыка';
$podrub['Культура'][1]='Литература';
$podrub['Культура'][2]='Кино';
$podrub['Культура'][3]='Театры';
$podrub['Культура'][4]='Фотография';
$podrub['Культура'][5]='Музеи';
$podrub['Культура'][6]='Изобразительные искусства';
$podrub['Культура'][7]='Танец';
$podrub['Культура'][8]='Универсальное';
$podrub['Культура'][9]='Прочее';

$podrub['Спорт'][0]='Футбол';
$podrub['Спорт'][1]='Хоккей';
$podrub['Спорт'][2]='Баскетбол';
$podrub['Спорт'][3]='Теннис';
$podrub['Спорт'][4]='Автоспорт';
$podrub['Спорт'][5]='Шахматы, шашки';
$podrub['Спорт'][6]='Силовые виды спорта';
$podrub['Спорт'][7]='Единоборства';
$podrub['Спорт'][8]='Спортивные трансляции';
$podrub['Спорт'][9]='Летние виды спорта';
$podrub['Спорт'][10]='Зимние виды спорта';
$podrub['Спорт'][11]='Экстремальный спорт';
$podrub['Спорт'][12]='Водный спорт';
$podrub['Спорт'][13]='Конкурсы,  тотализатор';
$podrub['Спорт'][14]='Спортивная пресса';
$podrub['Спорт'][15]='Соревнования';
$podrub['Спорт'][16]='Спортивные товары';
$podrub['Спорт'][17]='Спортклубы';
$podrub['Спорт'][18]='Универсальное';
$podrub['Спорт'][19]='Прочее';

$podrub['СМИ'][0]='Периодика';
$podrub['СМИ'][1]='Информационные агентства';
$podrub['СМИ'][2]='Новости';
$podrub['СМИ'][3]='Телевидение';
$podrub['СМИ'][4]='Радио';
$podrub['СМИ'][5]='Универсальное';
$podrub['СМИ'][6]='Прочее';

$podrub['Бизнес'][0]='Финансы';
$podrub['Бизнес'][1]='Недвижимость';
$podrub['Бизнес'][2]='Строительство';
$podrub['Бизнес'][3]='Производство и поставки';
$podrub['Бизнес'][4]='Реклама';
$podrub['Бизнес'][5]='Деловые услуги';
$podrub['Бизнес'][6]='Все для офиса';
$podrub['Бизнес'][7]='Универсальное';
$podrub['Бизнес'][8]='Прочее';

$podrub['Справки'][0]='Энциклопедии';
$podrub['Справки'][1]='Словари';
$podrub['Справки'][2]='Карты';
$podrub['Справки'][3]='Адреса и телефоны';
$podrub['Справки'][4]='Транспорт';
$podrub['Справки'][5]='Афиша';
$podrub['Справки'][6]='Интернет-каталоги';
$podrub['Справки'][7]='Поиск людей';
$podrub['Справки'][8]='Программы ТВ';
$podrub['Справки'][9]='Погода';

$podrub['Авто'][0]='Продажа автомобилей';
$podrub['Авто'][1]='Техническое обслуживание';
$podrub['Авто'][2]='Запчасти, аксессуары';
$podrub['Авто'][3]='Подготовка водителей';
$podrub['Авто'][4]='Автопресса';
$podrub['Авто'][5]='Автолюбители';
$podrub['Авто'][6]='Мотоциклы';
$podrub['Авто'][7]='Автострахование';
$podrub['Авто'][8]='Автомобиль и закон';
$podrub['Авто'][9]='Универсальное';
$podrub['Авто'][10]='Прочее';

for($i=0; $i<=10;$i++){
	$get_rubr=strpos("_".$url_lev2, $rubr[$i]);
	if($get_rubr){
		//echo "<br />Есть вхождение ".$rubr[$i]."<br />";
		$group.='<b>'.$rubr[$i].'</b>&nbsp;&nbsp;&nbsp;';
		
		//подрубрики
		$j=0;
		while($podrub[$rubr[$i]][$j]){
			$get_podrubr=strpos($url_lev2, $podrub[$rubr[$i]][$j]);
			if($get_podrubr){
				$podgroup.=$podrub[$rubr[$i]][$j].'   ';
			}else{
				$url2=make_url($rubr[$i]." ".$podrub[$rubr[$i]][$j]);
				$podgroup.='<a href="/%D0%9A%D0%B0%D1%82%D0%B0%D0%BB%D0%BE%D0%B3/'.$url2.'" class="podrubr">'.$podrub[$rubr[$i]][$j].'</a>   ';
				
			}
			$j++;
		}
	}else{
		$url=make_url($rubr[$i]);
		$group.='<a href="/%D0%9A%D0%B0%D1%82%D0%B0%D0%BB%D0%BE%D0%B3/'.$url.'" class="rubr">'.$rubr[$i].'</a>&nbsp;&nbsp;&nbsp;';
	}
	
	

	
}
?>