<div id="ales"> 
<div class="frm" id="header"><div class="inviz" id="invhat"><br /></div> 
	
       <?
			include "div_menu01.php";
			
			include "div_menu02.php";
        
       ?>
    
    <!--<div class="frm" id="tot2">ЦЕНТР КУЛЬТУРНО-ДЕЛОВОЙ АКТИВНОСТИ <b>«ТОТЕМ»</b></div>-->
    <div id="mainpic">
    <div id="sidebar"><!--<div class="frm" id="tot5" align="left"><a href="/data_galer.php" class="gray01"><img src="/imag/photo.jpg" class="tum"/>&nbsp;ФОТОГАЛЕРЕЯ</a></div>-->
    	
    	<?
			//include "sidemenu.php";
			echo "|>menufile<|";
        
        ?>
        
        
        <!--<div id="sidepan"><br /></div>-->
    </div>
    <div id="hh01"><h1>|>subtitle1<|</h1><img src="/imag/dot_a0.png" width="150" height="1" style="margin-left:5px;"/>
    <p id="hh03">|>subtitle2<|</p>

    
	</div>
    	<img src="/imag/|>mainpic<|" width="540" height="248" style="float:right;"/>
        
        <div id="blabla">
        <!--
        <div id="blaimag">

        
        </div>
        -->
        <div id="bla" align="left">
        <!--<b>|>txtitle<|</b><br /><br /><br />-->
        
        <div class="pref" id="scale">
        <div class="dh2">Масштабность</div><div class="prefpic"><img src="/imag/pref01.jpg" /></div>

Большая вместимость комплекса позволяет проводить массовые мероприятия численностью до 6 000 человек и VIP-рауты с количеством гостей не превышающим 2 200 человек.
Масштабы зала, уникальная многоуровневая сцена, светодиодные экраны и плазменные панели площадью в тысячу квадратных метров, ультрасовременные световые и звуковые установки поднимают Totem на самый высокий уровень грандиозности и зрелищности шоу.
Общая площадь Totem Hall – 12 000 м².
</div>

<div class="pref" id="comf">
        <div class="dh2">Комфортность</div><div class="prefpic"><img src="/imag/pref02.jpg" /></div>
Вместительный паркинг, службы охраны и гардероба обеспечат быстрый и удобный доступ в зал. 

Трехъярусная конструкция зала, с роскошными ложами в сумме с уникальной, многоуровневой сценой и тысячей квадратных метров светодиодных экранов и плазменных панелей обеспечивают новый уровень комфорта и ощущения грандиозности происходящего. Каждому гостю будет обеспечен максимум звука, света и видимости сцены, что достигается благодаря ярусной конструкции зала и продуманному зонированию пространства
VIP ложи вмещают до 2 200 гостей – подобный уровень комфорта не обеспечивает ни один из существующих центров проведения мероприятий.

Большое количество удобно расположенных баров и помещений, обслуживающих кухню, обеспечивает максимально быстрое получение напитков и блюд.
</div>

<div class="pref" id="multifun">
        <div class="dh2">Многофункциональность</div><div class="prefpic"><img src="/imag/pref03.jpg" /></div>

Трансформация зала. Все пространство комплекса легко трансформируется под конкретное мероприятие. Возможно изменить размер сцены, зонирование зала и рассадку гостей, скрыть верхние ярусы и разместить дополнительные конструкции, благодаря чему зал может быть подготовлен для проведения разноплановых мероприятий: концертов, корпоративов, выставок, премьер и модных показов.

Трансформация сцены. Многоуровневая, трансформирующаяся сцена площадью 150 м² спроектирована для организации динамичных шоу и неожиданных пространственных решении, обеспечивает свободу творчества режиссеру, позволяя задействовать большое количество артистов и спецэффектов. В сочетании с работой тысячи квадратных метров светодиодных экранов создается непередаваемый эффект грандиозности.
</div>

<div class="pref"  id="occup">
        <div class="dh2">Месторасположение</div><div class="prefpic"><img src="/imag/pref04.jpg" /></div>

Комплекс расположен в центре города в 5 километрах от Кремля, около пересечения правительственной трассы Кутузовский проспект с третьим транспортным кольцом.
Легко доступен для различных видов транспорта. Организован просторный паркинг на 500 мест.  Ближайшие станции метро: «Кутузовская» и «Парк Победы».
</div>




        </div>
        </div>
<div class="frm" id="footer"> (c) Все права защищены "Тотем Холл" 2012</div>
    </div>
  
   <div class="frm" id="tot1" align="right">Центр Культурно-Деловой<br> Активности</div>

  
  
	
    <div class="frm" id="header0">
    	
    </div>
    
    
    <div class="frm" id="doors">
        <div class="frm" id="headtxt">
         </div>
    </div>
    <!--<div class="frm" id="logo"><a href="/"><img src="imag/totem.jpg" width="300" height="72" class="totem" border="0"/></a></div>-->
    
    
  </div>   
</div>